<?php
    /*

    DUMMY magic     {{!dummy w=50}} {{!dummy 5x2}}
    -----------

    ѕлагин-магик, который формирует "распорку" заданных размеров,
    пользу€сь /core/_/dummy.html в качестве сырь€.

    ! всегда работает на этапе компил€ции шаблонов

    »спользуют:  * при табличной вЄрстке страниц
    
    ---------

    NB: ƒл€ корректной работы текущего шаблона
        нужен класс в CSS .block { display:block }

    ==================================================== v.0 (kuso@npj)

    $params:   "w", "h"    => размеры горизонтали и вертикали. ”молчание == 1х1
               "0"         => "WxH", например "50x20"

    */


    // text берЄм из параметров, которые нам даЄт Rockette
    $w=1; $h=1;
    if (isset($params["w"]) && $params["w"]) $w = 1*$params["w"];
    if (isset($params["h"]) && $params["h"]) $h = 1*$params["h"];
    if (($w==1) && ($h==1)) 
     if ($params[0])
     {
       $wh = explode("x", $params[0]); // английский »кс
       if (sizeof($wh) == 2) { $w = $wh[0]; $h = $wh[1]; }
       else
       {
         $wh = explode("х", $params[0]); // русский ’а
         if (sizeof($wh) == 2) { $w = $wh[0]; $h = $wh[1]; }
         else
         {
           $wh = explode("е", $params[0]); // русский ’а в DOS-кодировке
           if (sizeof($wh) == 2) { $w = $wh[0]; $h = $wh[1]; }
         }
       }
     }

    // распорка не должна быть сразу в двух направлени€х
    $h2=0;
    if (($w > 1) && ($h > 1)) 
    { 
      $h2=$h-1; $h=1; 
    }

    $tpl->Set("_w", $w);
    $tpl->Set("_h", $h);

    echo $tpl->Parse("_/dummy.html");

    // втора€ компонента распорки, если она нужна
    if ($h2 > 0)
    {
      $tpl->Set("_w", 1);
      $tpl->Set("_h", $h2);
      echo $tpl->Parse("_/dummy.html");
    }

?>
