<?php
$this->MSGS[] = array(

  //  Инплейс-редактирование
      "edit1click" => "редактировать",
  // --------------------------------------------------------------------------
  //  Тройки для правильного склонения (1 элемент, 2 элемента, много элементов)
      "Numbers" => array (
                     "items"      => array( "элемент",  "элемента", "элементов" ),
                     "records"  =>  array("запись", "записи", "записей"),
                     "clients"      => array( "клиент",  "клиента", "клиентов" ),
                     "found"      => array( "Найден",  "Найдено", "Найдено" ),
                     "answers"      => array( "ответ",  "ответа", "ответов" ),
                     "years"      => array( "год",  "года", "лет" ),
          	     "days"      => array( "день",  "дня", "дней" ),
                     "pages"      => array( "страница", "страницы", "страниц" ),
                     "positions"  => array( "позиция",  "позиции", "позиций" ),
                     "objects"  => array( "объект",  "объекта", "объектов" ),
                     "objects_datelnyi"  => array( "объекту",  "объектам", "объектам" ),
                     "goods"  => array( "товар",  "товара", "товаров" ),
                     "votes"    => array( "голос",  "голоса", "голосов" ),
                     "matches"    => array( "совпадение",  "совпадения", "совпадений" ),
                     "comments"    => array( "комментарий",  "комментария", "комментариев" ),
                        ),
  // --------------------------------------------------------------------------
  //  Месяцы
      "Months"  => array("января", "февраля", "марта", "апреля", "мая",  "июня", 
                      "июля", "августа", "сентября", "октября", "ноября", "декабря"),
      "Months1" => array("Январь", "Февраль", "Март", "Апрель", "Май",  "Июнь", 
                       "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"),
  // --------------------------------------------------------------------------
  //  Форм-процессор
      "Form.invalid"         => "Ошибки при заполнении поля:",
      "Form.invalid_group"   => "При заполнении полей допущены ошибки",
      "Form.not_empty"       => "*",
  // --------------------------------------------------------------------------
  //  Для HtmlMimeMail
      "Encodings" => array(
                "html_encoding" => "quoted-printable",
                "text_encoding" => "quoted-printable",
                "text_wrap" => "60",
                "html_charset" => "Windows-1251",
                "text_charset" => "Windows-1251",
                "head_charset" => "Windows-1251",
                ),
                     );
?>
